app/controllers/carts_controller.rb

  def show
    begin
      @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @cart = current_cart
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]