app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @categories ||= Category.all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @category ||= Category.find(params[:id])