app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items"
---
  def index
    @line_items = LineItem.all

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 03 Jun 2013 20:19:44 UTC +00:00], ["updated_at", Mon, 03 Jun 2013 20:19:44 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 4], ["created_at", Thu, 06 Jun 2013 17:36:33 UTC +00:00], ["order_id", nil], ["product_id", 1], ["quantity", 1], ["updated_at", Thu, 06 Jun 2013 17:36:33 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2013-06-05 03:52:08.495069' WHERE "line_items"."id" = 2
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save