app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @orders = Order.paginate page: params[:page],
            order: 'created_at desc', per_page: 10

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @order = Order.find(params[:id])

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 3
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 3
---
  def new
    @cart = current_cart
    if @cart.line_items.empty?

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 06 Jun 2013 18:58:30 UTC +00:00], ["updated_at", Thu, 06 Jun 2013 18:58:30 UTC +00:00]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", ""], ["created_at", Wed, 05 Jun 2013 04:16:52 UTC +00:00], ["email", ""], ["name", ""], ["pay_type", ""], ["updated_at", Wed, 05 Jun 2013 04:16:52 UTC +00:00]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 4]]
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])