app/controllers/products_controller.rb

  def edit
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "products" SET "photo_file_name" = 'FGW00001W0.jpg', "photo_content_type" = 'image/jpeg', "photo_file_size" = 64185, "photo_updated_at" = '2013-06-16 18:23:38.645211', "category_id" = 1, "updated_at" = '2013-06-16 18:23:39.108178' WHERE "products"."id" = 3

  def who_bought
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3"]]