app/controllers/store_controller.rb

SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products" ORDER BY title
---
  def index
    locale = params[:set_locale]
    if locale
     redirect_to store_path(locale: locale)
    else
      @categories = Category.all


     @products = Product.order(:title)