app/views/store/index.html.erb

SELECT "categories".* FROM "categories"
---
			<ul>
				<% Category.all.each do |cat| %>